Revit 2024 API
BuiltInFailures.WallFailures.CannotUpdateWallPanel Property
 Unable to update wall panel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotUpdateWallPanel { get; }
Visual Basic
Public Shared ReadOnly Property CannotUpdateWallPanel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotUpdateWallPanel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace